app/controllers/men_stores_controller.rb

DELETE FROM "men_stores" WHERE "men_stores"."id" = ?  [["id", 980190962]]
---
  def destroy
    @men_store.destroy

SELECT  "men_stores".* FROM "men_stores"  WHERE "men_stores"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_men_store
      @men_store = MenStore.find(params[:id])