app/controllers/women_stores_controller.rb

  def index
    @women_stores = WomenStore.all
---
SELECT "women_stores".* FROM "women_stores"

  def create
    @women_store = WomenStore.new(women_store_params)

    respond_to do |format|
      if @women_store.save
---
INSERT INTO "women_stores" ("created_at", "image", "item_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-27 02:00:28.006273"], ["image", "MyString"], ["item_name", "MyString"], ["updated_at", "2014-11-27 02:00:28.006273"]]

  def destroy
    @women_store.destroy
---
DELETE FROM "women_stores" WHERE "women_stores"."id" = ?  [["id", 980190962]]

    def set_women_store
      @women_store = WomenStore.find(params[:id])
---
SELECT  "women_stores".* FROM "women_stores"  WHERE "women_stores"."id" = ? LIMIT 1  [["id", 980190962]]